app/Models/V1/Mdl_member.php

INSERT INTO `member` (`appid`, `email`, `passwd`) VALUES ('94423', 'demo@gmail.com', 'f7c3bc1d808e04732adf679965ccc34ca7ae3441')
UPDATE `member` SET `status` = 'new', `token` = 'xw13q0o9jky2mpdqncm36ok01u1l91pr1dv5z6nxwr48l771', `created_at` = '2023-05-08 06:49:16'
WHERE `id` = 0
---
    public function add($data = array())
    {
        $tblmember = $this->db->table("member");
        $this->db->transStart();
        if (!$tblmember->insert($data)) {
            $psn = array("error" => "Email already used");
            // throw new Exception("Email already used");
        }

        $id = $this->db->insertID();
        $mdata = array(
            "status" => "new",
            "token" => $this->generate_token($id),
            "created_at" => date("Y-m-d H:i:s"),
        );

        $tblmember->where("id", $id);
        if (!$tblmember->update($mdata)) {

UPDATE `member` SET `token` = NULL, `status` = 'active'
WHERE `id` = '40'
AND `status` = 'new'
---
    public function activate($id)
    {
        $tblmember = $this->db->table("member");
        $mdata = array(
            "token" => NULL,
            "status" => "active",
        );
        $tblmember->where("id", $id);
        $tblmember->where("status", "new");
        $tblmember->update($mdata);

UPDATE `member` SET `token` = 'nzknwvm964jqp2glr1s8j34zj6tv86y8vngl38x5yr01z7ow'
WHERE `email` = 'demo@gmail.com'
---
    public function resetToken($email)
    {
        $sql = "SELECT id FROM member WHERE email=?";
        if (!$this->db->query($sql, $email)->getRow()) {
            $error = [
                "code"       => "5051",
                "error"      => "07",
                "message"    => "Member not found"
            ];
            return (object) $error;
        }
        $id = $this->db->query($sql, $email)->getRow()->id;

        $member = $this->db->table("member");
        $token = $this->generate_token($id);

        $member->where('email', $email);
        $member->set("token", $token);
        $member->update();

UPDATE `member` SET `passwd` = '123456789', `token` = NULL
WHERE `email` = 'demo@gmail.com'
AND `token` = 'nzknwvm964jqp2glr1s8j34zj6tv86y8vngl38x5yr01z7ow'
---
    public function change_password($mdata, $where)
    {
        $member = $this->db->table("member");
        $member->where($where);
        $member->update($mdata);

INSERT INTO `outlet` (`member_id`, `namaoutlet`, `bisnis_category`, `alamat`, `kota`, `telp`, `created_at`, `update_at`) VALUES ('40', 'Tokokukaku', 'Buahan', 'Jln. Alama semesta', 'Malang', '081234567890', '2023-05-08 08:53:15', '2023-05-08 08:53:15')
---
    public function createOutlet($mdata = array())
    {
        $outlet = $this->db->table("outlet");
        if (!$outlet->insert($mdata)) {